# Дан список, необходимо создать словарь с кубами элементов списка с использованием compi hanchen 
lst_1 = [1, 2, 3, 6, 78, 456, 3, 55, 89, 78]

dct_1 = {el: el** 3 for el in lst_1}
print(dct_1)
