# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа

print('Enter N')
num = int((float(input()) * 10) % 10)
print(num)